In [1]:
import pandas as pd

In [2]:
df1 = pd.Series(["Booze", "Mad", 4, 5.2, True])

In [3]:
df = pd.read_csv("pandas_for_everyone/data/scientists.csv")
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [4]:
df.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [5]:
mean = df["Age"].mean()

In [6]:
df[df["Age"] > mean]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

## Operations on vectors

In [7]:
df["Age"] + df["Age"]

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [8]:
df["Age"] * df["Age"]

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [9]:
df["Age"] * 10

0    370
1    610
2    900
3    660
4    560
5    450
6    410
7    770
Name: Age, dtype: int64

In [10]:
df["Age"] + pd.Series([4, 40, 400])

0     41.0
1    101.0
2    490.0
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [11]:
df.sort_index(ascending=False)

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [12]:
filt = (df["Age"] > df["Age"].mean())
df[filt]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [13]:
# ? 
# df.loc[[True, True, False, True, False, True]]

In [14]:
df * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [18]:
died_datetime = pd.to_datetime(df["Died"])
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [20]:
df["Died datetime"] = died_datetime
df

,Name,Born,Died,Age,Occupation,Died datetime
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1855-02-23

## Write

In [23]:
df.to_pickle("outputs/scientists.pickle")

In [26]:
df.to_csv("outputs/scientists.csv", sep="\t")